# Пространство памяти и время

import math
import random
from src.learning_python.permute import permute2

print(math.factorial(50))
# 30414093201713378043612608166064768844377641568960512000000000000
p3 = permute2(list(range(50)))
print(next(p3))     # permute1 здесь не подходит!
# [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49]


print('-' * 80)
print(math.factorial(20))   # permute1 здесь не подходит
seq = list(range(20))
random.shuffle(seq) # Предварительно перетасовать последовательность случайным образом
p = permute2(seq)
# Вывод может отличаться
print(next(p))
# [18, 1, 0, 17, 6, 9, 15, 19, 14, 7, 16, 2, 4, 10, 12, 3, 11, 5, 13, 8]
print(next(p))
# [18, 1, 0, 17, 6, 9, 15, 19, 14, 7, 16, 2, 4, 10, 12, 3, 11, 5, 8, 13]

random.shuffle(seq)
p = permute2(seq)
# Вывод может отличаться
print(next(p))
# [1, 3, 11, 8, 13, 12, 4, 7, 2, 18, 19, 10, 17, 0, 16, 14, 9, 6, 5, 15]
print(next(p))
# [1, 3, 11, 8, 13, 12, 4, 7, 2, 18, 19, 10, 17, 0, 16, 14, 9, 6, 15, 5]
