import sys

# Сложные примеры форматирования

print('{0:10} = {1:10}'.format('spam', 123.4567))
# spam       =   123.4567
print('{0:>10} = {1:<10}'.format('spam', 123.4567))
#       spam = 123.4567
print('{0.platform:>10} = {1[kind]:<10}'.format(sys, dict(kind='laptop')))
#      win32 = laptop

print('\nМожно опускать аргументы')
print('{:10} = {:10}'.format('spam', 123.4567))
print('{:>10} = {:<10}'.format('spam', 123.4567))
print('{.platform:>10} = {[kind]:<10}'.format(sys, dict(kind='laptop')))

print('\nЧисла с плавающей точкой')
print('{0:e}, {1:.3e}, {2:g}'.format(3.14159, 3.14159, 3.14159))
# 3.141590e+00, 3.142e+00, 3.14159
print('{0:f}, {1:.2f}, {2:06.2f}'.format(3.14159, 3.14159, 3.14159))
# 3.141590, 3.14, 003.14

print('\nРазличные системы счисления')
print('{0:X}, {1:o}, {2:b}'.format(255, 255, 255))
# FF, 377, 11111111
print(bin(255), int('11111111', 2), 0b11111111)
# 0b11111111 255 255
print(hex(255), int('FF', 16), 0xFF)
# 0xff 255 255
print(oct(255), int('377', 8), 0o377)
# 0o377 255 255
print('{0:#x}, {1:#o}, {2:#b}'.format(255, 255, 255))
# 0xff, 0o377, 0b11111111

print('\nЖёстко закодированные параметры')
print('{0:.2f}'.format(1 / 3.0))
# 0.33
print('%.2f' % (1 / 3.0))
# 0.33

print('\nПолучение значений из аргументов')
print('{0:.{1}f}'.format(1 / 3.0, 4))
# 0.3333
print('%.*f' % (4, 1 / 3.0))
# 0.3333

print('\nВстроенная функция format()')
print(format(1.2345, '.2f'))
# 1.23

print('\nРазделитель тысяч')
print('{0:d}'.format(999999999999))
# 999999999999
print('{0:,d}'.format(999999999999)) # Python 2.7, 3.1+
# 999,999,999,999
print('У форматирования выражения % разделитель тысяч отсутствует')