import math

print(math.pi, math.e)  # Общие константы
# 3.141592653589793 2.718281828459045
print(math.sin(2 * math.pi / 180))  # Синус, косинус, тангенс
# 0.03489949670250097
print(math.sqrt(144), math.sqrt(2))  # Квадратный корень
# 12.0 1.4142135623730951
print(pow(2, 4), 2 ** 4, 2.0 ** 4.0)  # Возведение в степень
# 16 16 16.0
print(abs(-42.0), sum((1, 2, 3, 4)))  # Абсолютное значение, суммирование
# 42.0 10
print(min(3, 1, 2, 4), max(3, 1, 2, 4))  # Минимум, максимум
# 1 4

print(math.floor(2.567), math.floor(-2.567))  # Округление в меньшую сторону
# 2, -3
print(math.trunc(2.567), math.trunc(-2.567))  # Усечение
# 2, -2
print(int(2.567), int(-2.567))  # Усечение (преобразование в целое число)
# 2, -2
print(round(2.567), round(2.467), round(2.567, 2))  # Округление
# 3 2 2.57
print('%.1f' % 2.567, '{0:.2f}'.format(2.567))  # Округление для отображения
# 2.6 2.57

# 3 примера вычисления квадратного корня
print(math.sqrt(144), 144 ** .5, pow(144, .5))
# 12.0 12.0 12.0
