# Списки

print('Вставка, замена, удаление')
L = ['spam', 'Spam', 'SPAM!']
L[0:2] = ['eat', 'more']
print(L)
# ['eat', 'more', 'SPAM!']

L = [1, 2, 3]
L[1:2] = [4, 5]  # Замена/вставка
print(L)
# [1, 4, 5, 3]
L[1:1] = [6, 7]  # Вставка (ничего не заменяет)
print(L)
# [1, 6, 7, 4, 5, 3]
L[1:2] = []  # Удаление (ничего не вставляет)
print(L)
# [1, 7, 4, 5, 3]

L = [1]
L[:0] = [2, 3, 4]
print(L)  # Вставка в начало
# [2, 3, 4, 1]
L[len(L):] = [5, 6, 7]  # Вставка в конец
print(L)
# [2, 3, 4, 1, 5, 6, 7]
L.extend([8, 9, 10])  # Вставка в конец
print(L)
# [2, 3, 4, 1, 5, 6, 7, 8, 9, 10]

L = ['eat', 'more', 'SPAM!']
L.append('please')
print(L)
# ['eat', 'more', 'SPAM!', 'please']
