print('Разделяемые ссылки и изменения на месте')
L1 = [2, 3, 4]
L2 = L1
L1[0] = 24
print(L1)  # [24, 3, 4]
print(L2)  # [24, 3, 4]

L1 = [2, 3, 4]
L2 = L1[:]
L1[0] = 24
print(L1)  # [24, 3, 4]
print(L2)  # [2, 3, 4]

print('\nКопирование')
import copy

L1 = [1, 2, 3]
print(L1.copy())
print(copy.copy(L1))  # Поверхностное копирование
print(copy.deepcopy(L1))  # Глубокое копирование

print('\nРазделяемые ссылки и равенство')
L = [1, 2, 3]
M = L
print(L == M)  # Одинаковые значения
print(L is M)  # Одинаковые объекты, is - проверка на идентичность

L = [1, 2, 3]
M = [1, 2, 3]
print(L == M)
print(L is M)  # Разные объекты

X = 42
Y = 42
print(X == Y)
print(X is Y)  # Идентичны! Эффект кэширования

print('\nКоличество ссылок')
import sys

print('Кол-во ссылок на объект 1: ' + str(sys.getrefcount(1)))  # Кол-во ссылок на объект 1: 4294967295
